import math

def area(r):
    """
    Вычисляет площадь круга по его радиусу.
    Параметры:
        r (int | float): радиус круга.
    Возвращаемое значение:
        float: площадь круга.
    Пример вызова:
        >>> area(2)
        12.566370614359172
    """
    return math.pi * r * r

def perimeter(r):
    """
    Вычисляет длину окружности по её радиусу.
    Параметры:
        r (int | float): радиус круга.
    Возвращаемое значение:
        float: длина окружности.
    Пример вызова:
        >>> perimeter(2)
        12.566370614359172
    """
    return 2 * math.pi * r
