def area(a:float) -> float:
    """
    Вычисляет площадь квадрата по длине его стороны.

    Параметры:
        a (int | float): длина стороны квадрата.

    Возвращаемое значение:
        int | float: площадь квадрата.

    Пример вызова:
        >>> area(2)
        4
    """
    return a * a

def perimeter(a:float) -> float:
    """
    Вычисляет периметр квадрата по длине его стороны.

    Параметры:
        a (int | float): длина стороны квадрата.

    Возвращаемое значение:
        int | float: периметр квадрата.

    Пример вызова:
        >>> perimeter(2)
        8
    """
    return 4 * a
